ANSHUMANDOCX/STM32-Walkie-Talkie/FIRMWARE/Core/Inc/sx1278.h
#ifndef SX1278_H
#define SX1278_H

#include "stm32f4xx_hal.h"
#include <stdint.h>
#include <stdbool.h>

/* ─── SX1278 Registers ───────────────────────────────── */
#define REG_FIFO                0x00
#define REG_OP_MODE             0x01
#define REG_FRF_MSB             0x06
#define REG_FRF_MID             0x07
#define REG_FRF_LSB             0x08
#define REG_PA_CONFIG           0x09
#define REG_LNA                 0x0C
#define REG_FIFO_ADDR_PTR       0x0D
#define REG_FIFO_TX_BASE_ADDR   0x0E
#define REG_FIFO_RX_BASE_ADDR   0x0F
#define REG_FIFO_RX_CURR_ADDR   0x10
#define REG_IRQ_FLAGS           0x12
#define REG_RX_NB_BYTES         0x13
#define REG_PKT_SNR_VALUE       0x19
#define REG_PKT_RSSI_VALUE      0x1A
#define REG_MODEM_CONFIG1       0x1D
#define REG_MODEM_CONFIG2       0x1E
#define REG_PREAMBLE_MSB        0x20
#define REG_PREAMBLE_LSB        0x21
#define REG_PAYLOAD_LENGTH      0x22
#define REG_MODEM_CONFIG3       0x26
#define REG_DETECTION_OPTIMIZE  0x31
#define REG_DETECTION_THRESHOLD 0x37
#define REG_SYNC_WORD           0x39
#define REG_DIO_MAPPING1        0x40
#define REG_VERSION             0x42
#define REG_PA_DAC              0x4D

/* ─── SX1278 Modes ───────────────────────────────────── */
#define MODE_LONG_RANGE         0x80
#define MODE_SLEEP              0x00
#define MODE_STDBY              0x01
#define MODE_TX                 0x03
#define MODE_RX_CONTINUOUS      0x05
#define MODE_RX_SINGLE          0x06

/* ─── IRQ flags ──────────────────────────────────────── */
#define IRQ_TX_DONE             0x08
#define IRQ_RX_DONE             0x40
#define IRQ_PAYLOAD_CRC_ERROR   0x20
#define IRQ_RX_TIMEOUT          0x80

/* ─── PA config ──────────────────────────────────────── */
#define PA_BOOST                0x80

/* ─── Public API ─────────────────────────────────────── */
bool    SX1278_Init(uint32_t frequency, uint8_t sf, uint32_t bw,
                    uint8_t cr, uint8_t preamble, uint8_t power);
void    SX1278_SetMode(uint8_t mode);
void    SX1278_SetTxMode(void);
void    SX1278_SetRxMode(void);
void    SX1278_Send(uint8_t *data, uint8_t len);
uint8_t SX1278_Receive(uint8_t *buf, uint8_t maxLen);
uint8_t SX1278_GetIRQFlags(void);
void    SX1278_ClearIRQ(void);
int16_t SX1278_GetRSSI(void);
int8_t  SX1278_GetSNR(void);
void    SX1278_Reset(void);

#endif /* SX1278_H */
